first_route/app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "aa2@gmail.com"], ["updated_at", "2018-10-15 19:30:52.584898"], ["id", 3]]